reg/Update EVC passing lr status as Disconnnected to EVC having Activ....xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Body>
		<tns:UpdateCircuitRequest xsi:schemaLocation="http://www.ICLNBI.com/ICLNBI_V2.00.xsd C:\Rashmi\XMLSPY\ICL_V2.01.xsd" xmlns:tns="http://www.ICLNBI.com/ICLNBI_V2.00.xsd" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
			<MessageElements>
				<MessageAddressing>
					<from>DSP</from>
					<to>ICL</to>
					<replyTo>DSP</replyTo>
					<messageID>DSP1381851999180</messageID>
					<action>DisconnectedEVC</action>
					<!--"DisconnectedEVC" for disconnected EVC/OVC "AddAssociation" - add evc to uni association, "RemoveAssociation" - remove evc to uni association, "UpdateCircuit" - update parameters-->
					<timestamp>Tue Oct 15 10:46:39 CDT 2013</timestamp>
					<transactionID>1381851999180</transactionID>
					<serviceName>UpdateCircuit</serviceName>
					<serviceVersion>3.0</serviceVersion>
					<userId>DSPWFPP</userId>
					<password>DSPWFPP</password>
				</MessageAddressing>
			</MessageElements>
			<Circuit xsi:type="tns:EVCCircuit">
				<commonName>15/VLGS/613794//CTRL</commonName>
				<sourceSystem>ARM</sourceSystem>
				<ResourceType>EVC</ResourceType>
				<lrStatus>Disconnected</lrStatus>
				<!--when removing or adding UNI, EVC status would be as is else it would be "Disconnected"-->
			</Circuit>
		</tns:UpdateCircuitRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
